RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_keyscan.h
#define CY_KEYSCAN_MD_DEBOUNCE_MIN        0U        /** Macro Down Debounce Minimum value */
#define CY_KEYSCAN_MD_DEBOUNCE_MAX        15U       /** Macro Down Debounce Maximum value */
#define CY_KEYSCAN_MU_DEBOUNCE_MIN        0U        /** Macro Up Debounce Minimum value */
#define CY_KEYSCAN_MU_DEBOUNCE_MAX        15U       /** Macro Up Debounce Minimum value */
#define CY_KEYSCAN_U_DEBOUNCE_MIN         0U        /** Micro Down Debounce Minimum value */
#define CY_KEYSCAN_U_DEBOUNCE_MAX         3U        /** Micro Down Debounce Maximum value */


#define CY_KEYSCAN_IS_ROW_COUNT_VALID(count)       (((count) >= CY_KEYSCAN_ROW_COUNT_MIN) && ((count) <= CY_KEYSCAN_ROW_COUNT_MAX))
#define CY_KEYSCAN_IS_COLUMN_COUNT_VALID(count)    (((count) >= CY_KEYSCAN_COLUMN_COUNT_MIN) && ((count) <= CY_KEYSCAN_COLUMN_COUNT_MAX))

#define CY_KEYSCAN_IS_MD_DEBOUNCE_VALID(count)     ((count) <= CY_KEYSCAN_MD_DEBOUNCE_MAX)
#define CY_KEYSCAN_IS_MU_DEBOUNCE_VALID(count)     ((count) <= CY_KEYSCAN_MU_DEBOUNCE_MAX)
#define CY_KEYSCAN_IS_U_DEBOUNCE_VALID(count)      ((count) <= CY_KEYSCAN_U_DEBOUNCE_MAX)


/** \endcond */

/**
* \addtogroup group_keyscan_data_structures
* \{
*/
/** keyscan callback  function definition. 
 ** Application has to register for callback for receiving the key press events.
*/
typedef void (* cy_cb_keyscan_handle_events_t)(void);
/**
 *****************************************************************************
 ** \brief keyscan configuration
 **        These settings are per KEYSCAN instance.
 *****************************************************************************/
typedef struct cy_stc_ks_config_t 
{
    uint8_t macroDownDebCnt;             /**< macro down debounce count */

    uint8_t macroUpDebCnt;               /**< macro Up debounce count */

    uint8_t microDebCnt;                 /**< micro debounce count */

    uint8_t noofRows;                    /**< set the number of rows of the key matrix */

    uint8_t noofColumns;                 /**< set the number of columns of the key matrix */

    bool ghostEnable;                    /**< Enable ghost detection. */

    bool cpuWakeupEnable;                /**< enables the keyscan block to wake the MCU module if key is detected. */

    bool clkStayOn;                      /**< The keyscan clock will stay on when set; otherwise, the clock will be gated off by when no activity is detected*/

}cy_stc_ks_config_t ;

/**
 *****************************************************************************
 ** \brief keyscan key event
 *****************************************************************************/
typedef struct cy_stc_key_event
{

    uint8_t keyCode;            /**< Key code. This is the location in the keyscan matrix that is pressed/released.
                                    May be implemented as ((row * numCols) + col) or ((col * numRows) + row. */

    uint8_t upDownFlag;         /**< Up/down flag */

    uint8_t scanCycleFlag;      /**< Should be toggled for every scan cycle in which a new event is queued.
                                   Use of this flag is optional. If used, it allows the consumer to determine whether
                                   an event is detected in the same scan cycle as the previous event or a different one.
                                   Note that this flag does not indicate any separation in time. */
}cy_stc_key_event;


/**
 *****************************************************************************
 ** \brief KEYSCAN  Context configuration
 **        These settings are per keyscan context.
 *****************************************************************************/
typedef struct cy_stc_keyscan_context_t
{
    cy_stc_key_event bufStart[KEYSCAN_FW_FIFO_SIZE];   /**< Location where the FW FIFO starts. Provided during initialization. */

    uint8_t maxNumElements;                   /**< Maximum number of elements that can be placed in the FW FIFO. Provided during initialization. */

    uint8_t curNumElements;                   /**< Number of elements currently in the FW FIFO */

    uint8_t readIndex;                        /**< Read index into the FW FIFO. */

    uint8_t writeIndex;                       /**< Write index into the FW FIFO. */

    uint8_t savedWriteIndexForRollBack;       /**< Saved write index for rollback. */

    uint8_t savedNumElements;                 /**< Saved number of elements for rollback. */
    
    uint8_t keysPressedCount;                 /**< Number of key down events that are not yet matched by key up events,
                                                  which gives the number of keys currently being pressed */
    
    bool keyscan_pollingKeyscanHw;            /**< Whether HW polling is done from Keyscan */
    
    cy_cb_keyscan_handle_events_t cbEvents;   /**< callback function */
}cy_stc_keyscan_context_t;

/** \} group_keyscan_data_structures */


/**
* \addtogroup group_keyscan_functions
* \{
*/
/*****************************************************************************/
/* Global function prototypes ('extern', definition in C source)             */
/*****************************************************************************/
                                             
/**
 *****************************************************************************
 ** \brief  Registers for callback 
 ** Application has to register for callback for receiving the key press events.
 ** In the interrupt handler data from HW FIFO is copied to FW FIFO and
 ** application is notified to get the data using this callback function.
 **
 ** \param [in]  cbEvents    Pointer to the callback function.
 **
 ** \param [in]  context     Pointer to the context.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_Register_Callback
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_Register_Callback(cy_cb_keyscan_handle_events_t cbEvents, cy_stc_keyscan_context_t* context);

/**
 *****************************************************************************
 ** \brief Register Context with the driver
 ** This Function registers for the event callback and FW FIFO buffer.
 **
 ** \pre The Application must configure corresponding keyscan pins 
 **      according to requirements and settings of keyscan instance.
 **
 ** \param [in] base       Pointer to KeyScan instance register area
 ** \param [in] config     KeyScan module configuration. See #cy_stc_ks_config_t.
 ** \param [in] context   Pointer to the context.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_Init
 *****************************************************************************/
cy_en_ks_status_t  Cy_Keyscan_Init(MXKEYSCAN_Type* base, const cy_stc_ks_config_t* config, cy_stc_keyscan_context_t *context );

/**
 *****************************************************************************
 ** \brief Deinit Keyscan.
 ** Deinits the Keyscan HW
 ** Clear FW FIFO after a HW reset.
 ** Restores the control data and enables scans if they were enabled before this function was called.
 **
 ** \param  base     [in]        Pointer to Keyscan instance register area.
 ** \param  context  [in]        Pointer to the context.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_DeInit
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_DeInit(MXKEYSCAN_Type* base, cy_stc_keyscan_context_t *context);

/**
 *****************************************************************************
 ** \brief Enable Keyscan.
 ** Enables the keyscan hardware.
 **
 ** \param  base    [in]  Pointer to KeyScan instance register area.
 ** \param  context [in]  Pointer to the context.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_Enable
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_Enable(MXKEYSCAN_Type* base, cy_stc_keyscan_context_t *context);

/**
 *****************************************************************************
 ** \brief Disable keyscan
 ** Reset's the Keyscan hardware and disables the keyscan hardware.
 ** When disabled, clock to the keyscan IP is gated.
 **
 ** \param  base    [in]  Pointer to KeyScan instance register area.
 ** \param  context [in]  Pointer to the context.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_Disable
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_Disable(MXKEYSCAN_Type* base, cy_stc_keyscan_context_t *context);

/**
 *****************************************************************************
 ** \brief Events pending
 ** Return whether any events are in the FW FIFO or not.
 **
 ** \param  base          [in]  Pointer to KeyScan instance register area.
 ** \param  context       [in]  Pointer to the context.
 ** \param  eventsPending [out] Pointer to the eventsPending, True if events pending and otherwise False.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_EventsPending
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_EventsPending(MXKEYSCAN_Type* base, bool *eventsPending, cy_stc_keyscan_context_t *context);

/**
 *****************************************************************************
 ** \brief Get next event from FW FIFO.
 ** Applications have to call \ref Cy_Keyscan_Interrupt_Handler from keyscan interrupt handler.
 ** After successfully reading from HW FIFO and writing to FW FIFO applications
 ** will be notified through the registered callback.
 ** Applications to read from the FW FIFO has to call this function in a loop till 
 ** the return value is CY_KEYSCAN_EVENT_NONE
 **
 ** \param  base          [in]  Pointer to KeyScan instance register area.
 ** \param  context       [in]  Pointer to the context.
 ** \param  event         [out] Pointer to the next event.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_ISR
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_GetNextEvent(MXKEYSCAN_Type* base, cy_stc_key_event *event, cy_stc_keyscan_context_t *context);

/**
 *****************************************************************************
 ** \brief Setup interrupt source to be accepted.
 **
 ** \param  base    [in]  Pointer to KeyScan instance register area.
 ** \param  mask    [in]  The mask with the OR of the interrupt source to be accepted.
 **                       See \ref group_keyscan_intr_mask_macro for the set of constants.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_ISR
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_SetInterruptMask(MXKEYSCAN_Type* base, uint32_t mask);

/**
 *****************************************************************************
 ** \brief Return interrupt mask setting.
 **
 ** \param  base [in]  Pointer to KeyScan instance register area.
 ** \param  mask  [out] The mask with the OR of the interrupt source which is masked.
 **                       See \ref group_keyscan_intr_mask_macro for the set of constants.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_ISR
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_GetInterruptMask(MXKEYSCAN_Type* base, uint32_t *mask);

/**
 *****************************************************************************
 ** \brief Return interrupt masked status.
 **
 ** \param  base    [in]  Pointer to KeyScan instance register area.
 ** \param  status  [out] The mask with the OR of the interrupt source which occurs.
 **                       See \ref group_keyscan_intr_mask_macro for the set of constants.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_ISR
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_GetInterruptMaskedStatus(MXKEYSCAN_Type* base, uint32_t *status);

/**
 *****************************************************************************
 ** \brief Return interrupt raw status.
 **
 ** \param  base    [in]  Pointer to Keyscan instance register area.
 ** \param  status  [out] The mask with the OR of the interrupt source which occurs.
 **                       See \ref group_keyscan_intr_mask_macro for the set of constants.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_ISR
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_GetInterruptStatus(MXKEYSCAN_Type* base, uint32_t *status);

/**
 *****************************************************************************
 ** \brief Clear interrupt status.
 **
 ** \param  base    [in]  Pointer to Keyscan instance register area.
 ** \param  mask    [in]  The mask with the OR of the interrupt source to be cleared.
 **                       See \ref group_keyscan_intr_mask_macro for the set of constants.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_ISR
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_ClearInterrupt(MXKEYSCAN_Type* base, uint32_t mask);

/**
 *****************************************************************************
 ** \brief Handler for keyscan interrupts.
 ** Applications have to call this function from keyscan interrupt handler.
 ** After successfully reading from HW FIFO and writing to FW FIFO this function
 ** will notify application to read from the FW FIFO.
 ** Application has to call Cy_Keyscan_getNextEvent() in a loop till 
 ** the return value is CY_KEYSCAN_EVENT_NONE
 **
 ** \param  base    [in]  Pointer to Keyscan instance register area.
 ** \param  context [in]  Pointer to the context.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_ISR
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_Interrupt_Handler(MXKEYSCAN_Type *base, cy_stc_keyscan_context_t *context);

/**
 *****************************************************************************
 ** \brief Flush events from HW FIFO.
 ** Flush the Fw FIFO also and it is equivalent to no key press events.
 **
 ** \param  base    [in]  Pointer to Keyscan instance register area.
 ** \param  context [in]  Pointer to the context.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_FlushEvents(MXKEYSCAN_Type *base, cy_stc_keyscan_context_t *context);

/**
 *****************************************************************************
 ** \brief Enables Ghost detection
 **
 ** \param  base    [in]  Pointer to Keyscan instance register area.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_EnableGhostDetection
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_EnableGhostDetection(MXKEYSCAN_Type *base);

/**
 *****************************************************************************
 ** \brief Disables Ghost detection
 **
 ** \param  base    [in]  Pointer to Keyscan instance register area.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_DisableGhostDetection
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_DisableGhostDetection(MXKEYSCAN_Type *base);

/**
 *****************************************************************************
 ** \brief Enables Clock Stay On
 ** Clock to the IP is always enabled.
 **
 ** \param  base    [in]  Pointer to Keyscan instance register area.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_EnableClockStayOn
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_EnableClockStayOn(MXKEYSCAN_Type *base);

/**
 *****************************************************************************
 ** \brief Disables Clock Stay On
 **  When there is no activity detected the clock to the Keyscan is gated off.
 **
 ** \param  base    [in]  Pointer to Keyscan instance register area.
 **
 ** \retval Refer \ref cy_en_ks_status_t
 **
 ** \funcusage
 ** \snippet keyscan/snippet/main.c snippet_Cy_Keyscan_DisableClockStayOn
 *****************************************************************************/
cy_en_ks_status_t Cy_Keyscan_DisableClockStayOn(MXKEYSCAN_Type *base);

/** \} group_keyscan_functions */
/** @} */




#ifdef __cplusplus
}
#endif
#endif /*(CY_IP_MXKEYSCAN) */
#endif /* __CY_KEYSCAN_H__ */

/** \} group_keyscan */
/*****************************************************************************/
/* EOF (not truncated)                                                       */
/*****************************************************************************/
